<a href="https://colab.research.google.com/github/Neel7317/Feature_selection/blob/main/Chi_Square_For_Feature_Selection_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

##Fisher Score- Chisquare Test For Feature Selection

Compute chi-squared stats between each non-negative feature and class.

**This score should be used to evaluate categorical variables in a classification task.**

This score can be used to select the n_features features with the highest values for the test chi-squared statistic from X, which must contain only non-negative features such as booleans or frequencies (e.g., term counts in document classification), relative to the classes.

Recall that the chi-square test measures dependence between stochastic variables, so using this function “weeds out” the features that are the most likely to be independent of class and therefore irrelevant for classification. The Chi Square statistic is commonly used for testing relationships between categorical variables.

It compares the observed distribution of the different classes of target Y among the different categories of the feature, against the expected distribution of the target classes, regardless of the feature categories.

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('titanic.csv')

In [3]:
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [6]:
#chosing the catgoical feature

In [10]:
##['sex','embarked','alone','pclass','Survived']
df=df[['Sex','Embarked','Pclass','Survived']]
df.head()

      Sex Embarked  Pclass  Survived
0    male        S       3         0
1  female        C       1         1
2  female        S       3         1
3  female        S       1         1
4    male        S       3         0

In [11]:
#lest perform encoding on sex columns

In [12]:
import numpy as np

In [13]:
df['Sex']=np.where(df['Sex']=="male",1,0)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [14]:
df.head()

   Sex Embarked  Pclass  Survived
0    1        S       3         0
1    0        C       1         1
2    0        S       3         1
3    0        S       1         1
4    1        S       3         0

In [15]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [16]:
### let's perform label encoding on embarked
ordinal_label = {k: i for i, k in enumerate(df['Embarked'].unique(), 0)}
df['Embarked'] = df['Embarked'].map(ordinal_label)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [17]:
df.head()

   Sex  Embarked  Pclass  Survived
0    1         0       3         0
1    0         1       1         1
2    0         0       3         1
3    0         0       1         1
4    1         0       3         0

In [19]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(df[['Sex','Embarked','Pclass']],df['Survived'],test_size=0.2)

In [18]:
from sklearn.feature_selection import chi2

In [20]:
col=chi2(X_train,y_train)
col#this gives us value in first line is chi2 score and in 2nd line P- vlaue

(array([77.50723848, 11.77692718, 28.93102127]),
 array([1.32236956e-18, 5.99693949e-04, 7.50020763e-08]))

In [21]:
p_values=pd.Series(col[1])
p_values.index=X_train.columns
p_values

Sex         1.322370e-18
Embarked    5.996939e-04
Pclass      7.500208e-08
dtype: float64

In [22]:
p_values.sort_index(ascending=False)

Sex         1.322370e-18
Pclass      7.500208e-08
Embarked    5.996939e-04
dtype: float64

In [ ]:
#so from here we can say that sex column most imp value for Survived prediction then pclass and then embarked..